doc/docs/explanation/README.md
```mermaid
stateDiagram-v2
  vcs : vcs *
  user : user-lib *
  executable : executable (eio)
  ocaml_git : ocaml_git_eio
  provider : ocaml-git-provider
  runtime : eio
  vcs --> user
  user --> executable
  ocaml_git --> provider
  runtime --> provider
  provider --> executable
```
